Версия 4.5 (17.11.2017)
– Исправлен баг с окном настройки мода. Перенесено в главное меню.
– Переделан внешний вид окна. Добавлены спецэффекты.

Версия 4.3c3 (24.12.2016)
– Исправлен баг с окном настройки мода.

Версия 4.3c2 (24.12.2016)
– Исправлен конфликт версий.

Версия 4.3c (24.12.2016)
– Полное исправление ошибки с отсутствием перевода у хоста.

Версия 4.3b (04.12.2016)
– Полный перевод игры версии 198581.
- Исправлены некоторые надписи, которые не помещались  рамки.
- Теперь работает перевод у хоста сервера, если мир был создан с пещерами. Сервер без пещер все еще не работает.

Версия 4.3a (24.11.2016)
– Исправлен баг с окном настройки мода.

Версия 4.3 (23.11.2016)
– Полный перевод игры версии 196113 (огромное спасибо Tanya Fox и её команде за этот перевод).

Версия 4.2i (15.05.2016)
– Переведены новые предметы, вещи и реплики всех персонажей, которые были на момент 174519 (да, я знаю, сейчас там многое добавилось и изменилось, но вы же не хотите ждать ещё пару недель?).
– Частично переведён текст версии 176665 (базовый текст и все новые реплики Уилсона).
– Свины и зайцы снова заговорили на русском.
– Исправлен небольшой баг, который мог привести к ошибке, если в игре присутствует чертёж предмета из мода.

Версия 4.2h (21.04.2016)
– Исправлен баг, приводящий к падению игры версии 174519.
– Отлючен забытый дебаг-вывод в лог.

Версия 4.2g (8.04.2016)
– Исправлен баг, приводящий к падению игры версии 172848.
– Функции регистрации нового названия предмета и действия не инициализируются, если русификатор находится в режиме «Только чат» или «Интерфейс и чат». Это должно предотвратить падения игры из-за модов, пытающихся переводить игру даже когда русификатор находится в одном из этих режимов.

Версия 4.2f (28.03.2016)
– Восстановлен перевод больших портретов, случайно испорченный в последних хотфиксах.
– Перевод актуализирован до версии 170618. Переведён весь добавленный за это время текст.

Версия 4.2e (21.01.2016)
– Исправлено падение игры, появившееся при нажатии на TAB в обновлении 163062.
– Добавлен перевод новых строк, накопившихся за последние несколько обновлений.
– Налажена совместимость с модом "More DST characters".

Версия 4.2d (14.01.2016)
– Исправлен баг с повсеместно дублирующимися буквами.
– WX-78 произносит эпитафии на надгробиях на русском языке, а также правильно произносит описание скелетов (имя убийцы переведено на русский).

Версия 4.2c (11.01.2016)
– Добавлена временная заплатка, исправляющая ошибку разработчиков при работе с utf-8 текстом на unix-системах, из-за которой падал русификатор.

Версия 4.2b (9.01.2016)
– Восстановлена работоспособность чата, нарушившаяся с выходом обновления 162028.
– Налажена работа мода в режиме «Только чат».
– Косметические улучшения в коде.

Версия 4.2a (7.01.2016)
– Теперь в чате выделенных серверов тоже можно писать на русском языке.
– Уменьшен шрифт названий серверов в левой части окна создания серверов.

Версия 4.2 (27.12.2015)
– Переведена большая часть нового текста, появившегося с введением в игру скинов.
– Переведены графические имена персонажей, показываемые над изображением персонажа при выборе его одежды.
– Вигфрид снова говорит на русском.
– Косметические исправления в игровом интерфейсе.
– PO файлы объединены в один. Новый PO файл соответствует формату программы POEdit.
– Изменён принцип подключения шрифтов. Теперь большее количество иностранных символов в шрифтах соответствует стилю этих шрифтов.
– Восстановлен вывод кавычек-ёлочек («») вместо лапок (" и ').

Версия 4.1 (24.12.2015)
– Восстановлена работоспособность после выхода обновления 161368.
– Возвращены пропавшие иконки перед анонс-сообщениями.
– Исправлена ошибка при конвертации текста из нижнего регистра в верхний («а» ошибочно преобразовывалось в «Ф»).
– Исправлены мелкие баги, приводящие к падению игры.
– Исправлен режим «Только чат». Теперь не должно быть лишнего переведённого текста, как и падений.
– Дополнительно выброшен неактуальный и устаревший код, который мог являться потенциальной причиной нестабильной работы игры.
– Переведена надпись на большом портрете случайного игрока, а также две иконки в настройках мира.

Версия 4.0 (15.12.2015)
– Версии русификатора для DST и просто Don't Starve разделены на два отдельных мода. Далее оба перевода будут развиваться и обновляться независимо.
– Игра адаптирована под версию 159550.
– Исправлен баг, приводящий к зависанию при входе в раздел со списком серверов.
– Разработчики добавили нативную поддержку текста в формате UTF-8. Весь перевод (в т.ч. PO файлы) переконвертирован на использование русского текста в этом формате.
– Исправлен баг, блокирующий смену режима сортировки в окне выбора серверов.
– Пользователи Linux и Mac OS теперь могут управлять курсором при вводе текста.
– Добавлена возможность писать на русском в чате окна выбора персонажа.

Версия 3.9 (25.07.2015)
– DST: Устранены самые важные критические проблемы, приводящие к падению игры в версии с новым интерфейсом (начиная с 144562).
– DST: Добавлена тестовая версия нового игрового шрифта. В будущем планируется его доработка.

Версия 3.8c (10.06.2015)
– Исправлен баг, из-за которого игра зависала с чёрным экраном в окне редактирования настроек мира.

Версия 3.8b (10.06.2015)
– DST: Исправлен баг, из-за которого возможны падения игры при попытке создать новый мир.
– Переведены новые рекламные сообщения.
– Исправлены склонения имён персонажей, которые были заспавнены из консоли, а так же анонс сообщения о них.

Версия 3.8a (8.06.2015)
– Исправлен закравшийся баг, из-за которого игра падала при загрузке мода Don't starve c DLC "Reign Of Giants".

Версия 3.8 (8.06.2015)
– «Зимометр» переименован в «Измеритель температуры».
– «Камень-грелка» переименован в «Термальный камень».
– DST: «Слизовечка» переименована в «слизовцу».
– DST: «Слизь овцы» переименована в «ворсистые сопли».
– DST: "Lavae" переименована в «лавовую личинку».
– DST: Исправлены неточности в склонениях некоторых названий.
– DST: Переведены все новые реплики, названия существ и предметов.
– DST: Восстановлен пропавший перевод некоторых реплик WX-78.
– DST: На указателях добавлена возможность вводить русские буквы. Не злоупотребляйте, на серверах бывают не только русские игроки :)
– DST: Для пользователей Linux и Mac OS добавлена возможность переключаться на русскую раскладку. Переключение осуществляется комбинацией Ctrl+Shift, при этом специальный индикатор отображает текущее состояние. Раскладка соответствует таковой в Windows (это касается способа ввода знаков препинания).

Версия 3.7a (22.04.2015)
– DST: Перевод адаптирован под версию 134666.
– DST: Исправлены мелкие текстовые недочёты и опечатки.
– DST: Анонс-сообщения о Веббере больше не произносятся во множественном числе.
– DST: Добавлена защита от двух редко случающихся ошибок, приводящих к падению игры.

Версия 3.7 (22.04.2015)
– DST: В связи с объединением DST и ROG выпущена новая версия. Устранены основные причины падений игры.
– DST: Подключены Веббер и Вигфрид с портретами и репликами.
– DST: Переведён появившийся новый текст.
– DST: Исправлен ещё один баг в репликах персонажей о скелетах.
– DST: Исправлен ряд ошибок в тексте.

Версия 3.6c (13.03.2015)
– DST: Исправлен баг, приводящий к ошибке в игре версии 129926.
– DST: Исправлена ошибка, из-за которой анонс-сообщения периодически неверно определяли пол персонажа и дописывали "Игрок ..." в начало сообщения.
– DST: Переведены несколько реплик, перевод которых был случайно упущен в предыдущем релизе.
– Исправлен ряд ошибок в тексте.

Версия 3.6b (7.03.2015)
– DST: Перевод адаптирован под версию 129286.
– DST: В шрифты добавлены новые пиктограммы для контроллеров.
– DST: Исправлены не совсем корректные описания причин смерти в случаях смерти от огня, холода или голода.
– DST: Исправлены два бага, из-за которых при попытке вывести анонс-сообщение об игроке неопознанного пола либо падала игра, либо выводилось некорректное сообщение.
– DST: Исправлен краш на странице настроек мода, возникавший при нажатии любой клавиши.
– DST: Подогнан размер текста на нескольких кнопках.
– Исправлен баг, из-за которого мод Season Clock выводил странные надписи.

Версия 3.6a (7.02.2015)
– DST: Исправлен баг, приводящий к ошибке в игре версии 126042.
– Теперь вы легко можете узнать, какая у вас версия русификатора, посмотрев её в описании мода во вкладке модов. Раньше для этого нужно было заходить в настройки русификатора.

Версия 3.6 (13.01.2015)
– Добавлена возможность создавать реплики, универсальные для персонажей разных полов. Ряд реплик Уилсона могут "достаться" женским персонажам, или Вебберу (который говорит о себе во множественном числе). Теперь эти реплики можно модифицировать таким образом, чтобы они менялись, в зависимости от персонажа, которому они достанутся. В связи с этим нововведением где-то в игре вы возможно увидите символы [ и ]. Если это произойдёт, сообщите пожалуйста в Steam Workshop мода.
– Переведено имя Максвелла, сидящего на троне. В связи с вышеуказанным нововведением изменены некоторые его реплики.
– В связи с вышеуказанным нововведением сделаны универсальными по полу все реплики Уилсона.
– Проведена проверка текста на сервисе Sourcelocalizer. Был выявлен и исправлен ряд опечаток.
– В окне, сообщающем о смерти игрока, согласованы слово "дней" и количество дней. Косметические улучшения в интерфейсе окна.
– DST: Перевод адаптирован под версию 122690.
– DST: Переработан и универсализирован код в обработчике анонс-сообщений и обработчике русских реплик.
– DST: Повышена совместимость с модами, которые что-то дописывают в начало или конец реплик персонажей.
– DST: Переработана функция склонения в творительном падеже (используется в репликах типа "был убит кем? чем?"). Правильность значительно повысилась, а всем предметам, которые не склоняются таким способом, заданы корректные формы вручную.
– DST: Исправлен баг, из-за которого возникала ошибка в момент смерти добавленного модом персонажа, если у него не задан пол.

Версия 3.5a (28.12.2014)
– DST: В соответствии с новым дизайном игры повторно переведены все большие портреты персонажей.
– DST: Восстановлен перевод иконок в окне настроек мира. Там-же согласованы слова в некоторых вариантах опций.
– DST: Кое-где подправлен непомещающийся текст.

Версия 3.5 (25.12.2014)
– DST: Перевод адаптирован под версию 122029.
– DST: Восстановлен перевод скелетов и сообщений при клике по игроку.
– DST: Временно отключён перевод больших портретов персонажей, поскольку они изменились. Когда перерисуем, включим снова.
– DST: Графические исправления в интерфейсе, связанные с редизайном игры.
– DST: Оптимизирован код.

Версия 3.4c (23.12.2014)
– DST: Критические исправления в связи с выходом обновления 121911. Исправлен краш при клике на скелет (мир должен быть пересоздан в 121911, старые скелеты крашат игру даже без русификатора), и краш при попытке просмотреть список игроков.
– DST: Налажена совместимость с модом "Dr.Wave".
– DST: Исправлена ошибка, возникающая при попытке осмотреть скелет Вэса.
– Исправлена фраза "Идти к Абигейлу".

Версия 3.4b (20.12.2014)
– DST: Налажена совместимость с модом "More DST Characters".
– DST: Исправлено ещё кое-что в отображении русских имён. Теперь-то уж всё должно работать как нужно. Надеюсь :) Этот фикс касается серверной стороны, поэтому если на сервере стоит старый русификатор, то имена могут по-прежнему иногда "терять" русские буквы.
– DST: Ewecus переименована в "Слизовечка". На форуме русской вики вы можете предложить и другие варианты.

Версия 3.4a (20.12.2014)
– DST: Теперь сервера с этим модом имеют тэг "russian". Игровой фильтр серверов учитывает теги, и если в фильтр ввести "russian", то будут показаны все сервера, у которых есть такой тег (даже если в названии сервера этого слова нет).
– DST: Переведены имена и реплики свинов-стражей.
– DST: Налажена совместимость с модом "DST RoG Characters".
– DST: Серверная функция c_announce теперь корректно выводит анонсы на русском языке.

Версия 3.4 (18.12.2014)
– DST: Перевод адаптирован под версию 121105.
– DST: Теперь имена игроков на русском языке должны отображаться корректно.
– DST: Теперь все анонс-сообщения (в верхней части экрана) учитывают пол персонажа. Если по какой-то причине пол определить не удалось, то перед никнеймом добавляется "Игрок " и далее считается, что это мужской пол.
– DST: В настройках мода появилась опция "Варианты русификации". Она позволяет частично (или даже полностью) отключать русификацию и нужна будет в основном тем, кто хочет писать в чате на русском, но играть в игру на английском.
– DST: Написаны особые формулировки анонс-сообщений и описаний скелетов для случаев, когда персонаж умер от голода, от перегрева или от холода.
– DST: Переведены анонс-сообщения голосования за изгнание игрока.
– DST: Исправлен баг перевода анонс-сообщений в свободном режиме, из-за которого наши англоязычные коллеги видели неправильные имена убийц, подключившись к серверу с этим модом.
– DST: Восстановлен перевод фраз о предметах, которые персонаж может починить.
– DST: Возвращён пропавший перевод слов Enabled и Disabled в настройках игры.
– DST: Возвращён пропавший перевод названий шаблонов в настройках создания карты.
– Изменены описания для действия "Собрать" на предметах "Птичья клетка", "Казан", "Сушилка" и "Улей". Действие для них теперь называется "Достать".
– Действие "Запереть" ("Imprison") переименовано в "Посадить в клетку".
– Все стандартные кавычки, такие как ' или " теперь автоматически заменяются на русские ёлочки «».

Версия 3.3a (12.12.2014)
– Исправлен баг в новых шрифтах, из-за которого при появлении в тексте одновременно пробелов и высоких символов ("р", "у" и т.п.) строка сползала вверх.
– DST: Исправлен баг, из-за которого высокие буквы не отображались в чат-логе.
– DST: Указан all_clients_require_mod=false. Это значит, что будучи установленным на сервере, мод не требует от клиентов наличия такого-же мода. К "русским" серверам можно подключаться без русификации, и на стороне клиента всё будет на английском.
– DST: Подправлен перевод в паре мест.

Версия 3.3 (12.12.2014)
– Начиная с этой версии мод выкладывается в двух ветках STEAM: оригинальной Don't Starve и Don't Starve Together Beta. Причём в ветке оригинальной Don't Starve будут выкладываться только те версии, которые вносят изменения в оригинальную игру или её DLC. Если изменения касаются только DST, то обновление будет выкладываться только в ветке DSTbeta.
– DST: Внесён перевод изменений, добавленных в игру на момент выхода 120034.
– DST: Переведены новые реплики и предметы, отлажены корректные формы этих предметов для различных действий.
– DST: Добавлена возможность вводить русские символы в чате.
– DST: Пересобраны все шрифты с учётом добавленных в DST символов. Теперь можно пользоваться почти всеми стандартными символами пунктуации.
– DST: Подправлен перевод в некоторых диалоговых окнах, связанных с регистрацией и авторизацией.
– DST: Исправлен потенциальный баг в переводе описания скелетов игроков.
– DST: Оптимизирован код.
– Исправлены описания чертежей. Теперь само название чертежа не склоняется в зависимости от действия. Раньше могло быть "Изучить чертёж 'Удочку'" и т.п.
– Исправлены мелкие баги.

Версия 3.2 (22.11.2014)
– Добавлен перевод Don't Starve Together. Из-за весомых изменений при переходе на клиент-серверную систему пришлось серьёзно модифицировать код. Есть вероятность, что в DST что-то где-то будет не переведено. Сообщайте, если увидите.
– Добавлен дополнительный файл, который содержит перевод Don't Starve Together. Файл лежит в папке с модом и называется DST.po
– Из-за ограничений клиент-серверной системы Don't Starve Together некоторые реплики персонажей переведены чуть-чуть по другому (однообразнее). Это касается только DST. Таких реплик в DST около двух десятков и изменения в основном "чисто косметические".
– Исправлен баг с безусловной инициализацией специального шрифта для Вигфрид даже на тех версиях игры, где ROG не установлен.
– Добавлен перевод известных рекламных сообщений, появляющихся на главной в левом углу. Однако всегда могут появиться новые, о которых мод ничего не знает.
– Добавлена реклама русскоязычной вики игры. Надеюсь, вы не против :)

Версия 3.1 (3.11.2014)
– В связи с остановкой работы сервиса Notabenoid автообновление в моде отключено. Возможно это временно. Если же Notabenoid покинул нас насовсем, функционал автообновления глав будет переработан или удалён полностью.
– Переведено описание рецепта "Паучьи яйца" Веббера (оно оказалось зашито в коде игры, и пришлось переводить его отдельно).
– Добавлен перевод строчки, которую внесли в одном из мини-обновлений.
– Для мода задан приоритет (priority = 1).
– В одном из шрифтов исправлена цифра 8, которая была слишком похожа на 6.
– Переведено на русский описание мода, если он активизирован. В противном случае описание остаётся на английском, что логично ;)
– Добавлена ссылка на мод в форуме Klei, куда можно перейти, кликнув по "Перейти на страницу мода!" под описанием мода.
– Косметическое исправление в консоли (ранее буквы типа "у" и "р" с нижними хвостиками не печатались в самой последней строке консоли).

Версия 3.0c (7.08.2014)
– Устранён неприятный баг, из-за которого в некоторых условиях в консоли отображался неправильный шрифт.
– Доработана обработка склонений прилагательных для различных нестандартных ситуаций (в том числе на случай появления новых русских слов в модах).
– Добавлена кнопка настройки мода, появляющаяся при наведении на мод в меню "Моды" (в том-же месте, что и у других модов в последних релизах игры). Эта кнопка будет видна только если мод уже включен. В настройках мода всё то-же, что вы можете видеть, зайдя через Настройки->Русификация.
– Исправлена последовательность слов в заголовке окна настроек модов (теперь слова идут в порядке, свойственном русскому языку).
– Добавлен перевод пары строк в окне логина Twitch, которые по какой-то причине отсутствуют в общеигровой текстовой базе.
– Добавлена функция RegisterRussianName, которая будет полезна создателям модов, желающим использовать русские названия предметов. Её описание можно найти в конце файла modmain.lua
– Модифицирована проверка, когда нужно обновлять мод. Теперь обновление выполняется только при запуске самой игры, и не выполняется при загрузке или создании мира.

Версия 3.0b (29.07.2014)
– Решён известный баг совместимости с модом RPG HUD, когда показывался не весь инвентарь. Есть ещё? Сообщайте.

Версия 3.0a (5.07.2014)
– Русификация приведена в соответствие игре версии 104670.
– Возвращена русифицированная картинка Уиллоу, которую я по невнимательности сам и отключил. Простите :)
– Переведён заголовок в окне трансляции, который разработчики почему-то не поместили в общую текстовую базу.

Версия 3.0 (2.07.2014)
– Русификация приведена в соответствие игре версии 102572.
– Добавлено 8 глав с репликами базовых персонажей в DLC. Теперь связанные с DLC реплики персонажи говорят на русском. Перевод сыроват, но над ним ещё будут работать, постепенно всё будет улучшаться. У каждого персонажа порядка 180 уникальных для DLC реплик.
– Налажено правильное склонение "мокрых", "засохших" и "дымящихся" предметов. Если заметите где-то ошибку, сообщайте.
– Доработано отслеживание заглавных букв в названиях предметов, совмещённых с префиксами типа "несвежий", "промокший" и т.п.
– Добавлен специальный шрифт для Вигфрид с умлаутами над буквой О.
– Переведены большие имена Веббера и Вигфрид, написанные на флагах в окне выбора нового персонажа.
– Переведены несколько пиктограмм в настройках, которые отображаются при создании пользовательского мира. Текст на них является частью изображения, поэтому пришлось переводить отдельно. Кроме того там-же исправлены мелкие несочетания слов в добавившихся опциях.
– Небольшие доработки и исправления в механике мода.

Версия 2.9 (21.06.2014)
– Доработана внутренняя механика мода. Теперь он может переводить реплики для DLC.
– Добавлен дополнительный файл перевода, который будет содержать перевод для DLC "Reign Of Giants". Файл лежит в папке с модом и называется ROG.po
– Переведены реплики Веббера и Вигфрид.
– Весь игровой текст приведён в соответствие с игрой версии 98986. В дальнейшем будет продолжена модернизация глав на Notabenoid до актуальной версии игры.
– Переработано окно обновления глав, поскольку их теперь слишком много. А будет ещё больше.
– Налажена совместимость мода и игры как с установленным DLC, так и без оного.

Версия 2.8 (16.04.2014)
– Начата подготовка к переводу DLC "Reign Of Giants".
– Переведены названия всех новых предметов, имена и описания новых персонажей, названия новых игровых действий.

Версия 2.7e (13.03.2014)
– Восстановлена работоспособность мода, в том числе и на UNIX системах. Проблема была в игровом баге, который разработчики допустили начиная с обновления 96692 и только теперь наконец исправили.
– Исправлен русский шрифт в окне загрузки главы режима adventure (и скорее всего в любых других забытых ранее местах).

Версия 2.7d (5.03.2014)
– Переработана система подключения шрифтов. Надеюсь, теперь она будет работать стабильно.
– Возможны проблемы в работе на UNIX системах. Исправление появится с одним из патчей от разработчиков. Ожидайте.

Версия 2.7c (1.03.2014)
– Внесено временное исправление, возвращающее нормальное отображение шрифтов в игре версии 96827.
– Возможны проблемы в работе на UNIX системах. В ближайшее время ожидайте исправлений.

Версия 2.7b (28.2.2014)
– Внесено временное исправление, восстанавливающее работоспособность мода в игре версии 96713.
– Исправлен баг, из-за которого неверно определялась версия файла перевода.

Версия 2.7 (27.2.2014)
– Исправлены основные ошибки, приводившие к неработоспособности мода в версии 96692. По прежнему могут быть баги и нарушения в работе.

Версия 2.6b (30.1.2014)
– Исправлено склонение устанавливаемых на землю крафтовых предметов, таких как палатка. Теперь пишет «Создать палатку» а не «Создать Палатка».

Версия 2.6 (28.1.2014)
– Исправлено написание чертежей предметов, для которых в игре оказались особые правила создания имени в обход перевода.
– Подправлен мелкий баг, из-за которого имя «Уилсон П. Хиггсбери» не склонялось.
– Немного увеличен шрифт описания создаваемых предметов в боковом меню.
– Подправлен мелкий баг с отображением кавычек и переводов строки, который проявлял себя при определённых достаточно редких условиях.
– Устранены ВСЕ различия между названиями предметов в игре и на русскоязычной wiki.
– Все накопленные за прошедшее время изменения в переводе включены в данный релиз (около 1300 правок).

Версия 2.5 (15.1.2014)
– Переведены большие имена персонажей, написанные на флагах в окне выбора нового персонажа.
– Исправлены несогласованные варианты опций в окне настроек пользовательского мира. Некоторые слова берутся из различных строк перевода и соединяются. На русском получалось с ошибками. Теперь всё в порядке.
– Слегка подправлен код в настройках мода. Исправлена пара мелких багов.

Версия 2.4 (12.1.2014)
– Теперь названия предметов в сочетании с действием не начинаются с большой буквы. Например вместо «Изучить Лепестки» теперь будет написано «Изучить лепестки». Для некоторых объектов сделаны исключения, которые вписаны в новую секцию po файла.
– Проведена работа по исправлению склонений имён зайцев и свиней. Теперь их имена склоняются корректно.
– Исправлены ошибки в склонениях нескольких предметов.
– Проведена ревизия названий предметов на соответствие с названиями, указанными на wiki.
– На notabenoid добавлена новая глава "private", в которой хранятся все склонения названий предметов для различных действий, корректные окончания для описания качеств предметов, и список названий предметов, которые должны писаться с большой буквы. Теперь при внутриигровом обновлении русификации мод сверяется с содержимым этой новой главы. Ранее эта информация хранилась только в po файле, из-за чего любое исправление любой из вышеуказанных вещей требовало выпуска новой версии русификатора.
– Переведены несколько пиктограмм в настройках, которые отображаются при создании пользовательского мира. Текст на них является частью изображения, поэтому пришлось переводить отдельно.
– Слегка упрощена структура po файла. Теперь мод самостоятельно считает количество записей для склонений и качеств предметов, находящихся в po.
– Небольшие изменения в алгоритме отображения лога, исправляющие мелкие баги.

Версия 2.3 (7.1.2014)
– Добавлена подсветка реплик при наведении мыши в логе изменений перевода.
– Теперь записи в логе изменений перевода не разрываются между страницами.
– Добавлена кнопка (пиктограмма с глазом), появляющаяся при наведении на ту или иную реплику в логе изменений перевода. При нажатии на эту кнопку в браузере откроется соответствующая запись notabenoid'a. Если нажать с зажатым Ctrl, то запись будет показана не индивидуально, а среди всех остальных записей главы.
– Изменения в скрипте проверки наличия альтернативных переводов. Иногда скрипт некорректно обрабатывал проверяемые файлы, из-за чего у некоторых сообщение о посторонних переводах появлялось постоянно.
– Уменьшен шрифт описания рецептов в окне рецептов, чтобы текст нормально помещался, иначе там три-четыре слова влезают.
– Добавлена возможность просматривать историю изменений мода в окне настроек русификации.

Версия 2.2c (1.1.2014)
– Отключён перевод названия последнего игрового обновления (ключ STRINGS.UI.MAINSCREEN.UPDATENAME), чтобы при появлении нового игрового обновления новое название не затиралось старым русским переводом.
– Исправлен баг, когда при каждом обновлении реплик из нотабеноида переобновлялись кнопки мыши.

Версия 2.2b (31.12.2013)
– Исправлен мелкий баг, чтобы отображались пиктограммы для левой и правой кнопок мыши.

Версия 2.2 (31.12.2013)
– Добавлены пиктограммы кнопок контроллера. Теперь играющие с контроллером от X-box смогут играть полноценно.
– Исправлен баг, из-за которого ряд предметов получал неправильные склонения для «Идти к».
– Исправлена ошибка, из-за которой не перевелись Enabled и Disabled в настройках игры.
– Исправлена ошибка, из-за которой не перевелись строки в интерфейсе настроек нового мира.
– Уменьшен шрифт в заголовке таблицы морга, теперь всё помещается.
– Изменён размер и положение текста в диалогах загрузки игры. Теперь надпись типа «Выживание 1-248» помещается.
– Скорректированы склонения нескольких слов.
– Добавлена проверка на наличие альтернативных переводов. Если в файле data/scripts/languages/language.lua обнаруживается подключение другого перевода, то оно автоматически деактивируется.
– Исправлен баг с переключением выбора частоты обновлений перевода. Теперь по умолчанию с клавиатуры можно переключать по пробелу а с контроллера по кнопке «действие».
– Подправлены положения надписей в интерфейсе настроек русификации.
– Изменено английское описание русификации в меню выбора модов.
– Небольшие изменения некоторых букв шрифтов, повышающие читабельность.
– Мелкие изменения, повышающие стабильность и универсальность для любой системы, на которой производится запуск игры.

Версия 2.1 (27.12.2013)
– Нарисованы русские шрифты в стиле оригинальных.
– Исправлен баг с запуском мода в системах на базе unix.
– Добавлена возможность писать в консоли по-русски.
– Косметические изменения.

Версия 2.0 (22.12.2013)
– Полностью переработан весь код.
– Проект оформлен в виде мода.
– Добавлено автоматическое обновление текста, которое синхронизируется с заданной периодичностью с тем, что находится на Notabenoid'е. Ваши изменения в Notabenoid'е будут тут-же включаться в игру, если игра произведёт такое обновление.
– Добавлено окно настроек мода (Находится в Настройки — Русификация). Там вы можете настроить периодичность, с которой будет обновляться текст, обновить его вручную, а так же там отображается список изменений, которые были произведены в обновлениях. Таким образом вы можете всегда увидеть, что именно было изменено вами, или другими участниками проекта перевода.
– Добавлена возможность задавать особые названия предметов для любого типа действия. Раньше особые названия задавались лишь для «Идти к» и «Изучить». Теперь, например, для действия «Собрать» и предмета «Ягодный куст» можно сделать (и я сделал) перевод «Собрать Ягоды» или «Собрать Ягоды с куста» вместо «Собрать Ягодный куст».

Версия 1.0 (10.12.2013)
– Полностью переведены все реплики и вообще весь текст включая самые последние изменения в игре.
– В переводе подключается специальная функция, которая корректным образом склоняет названия предметов в падежах, для того чтобы названия предметов сочетались с действиями. Пример: игра корректно напишет «Идти к Кролику» вместо «Идти к кролик».
– В переводе подключается специальная функция, которая корректным образом склоняет качества портящихся предметов в соответствии с их родом и числом. Например вместо «Несвежий Лепестки» будет писаться «Несвежие Лепестки».
– Шрифты подключаются автоматически, причём они не перекрывают имеющиеся в игре, а просто ставятся параллельно. Таким образом при выходе очередного игрового патча русские шрифты не слетят, как это было в предыдущих переводах Алевастора.